---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartExcluded
source: html/dd6d69c6-9efc-0288-ce78-b828a0a25e58.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartExcluded Property

"Excluded"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartExcluded { get; }
```